PLSCO/Glowduino_PC/Glowduino/hardware/teensy/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.keys=Keyboard Layout


glowdeck.name=Glowdeck V1
glowdeck.upload.protocol=halfkay
glowdeck.upload.maximum_size=259840
glowdeck.upload.maximum_ram_size=65536
glowdeck.upload.speed=12000000
glowdeck.upload.disable_flushing=true
glowdeck.bootloader.path=undefined
glowdeck.serial.restart_cmd=true
glowdeck.serial.safe_baud_rates_only=true
glowdeck.upload.avrdude_wrapper=GlowdeckUp
glowdeck.build.mcu=mk20dx256
glowdeck.build.cpu=cortex-m4
glowdeck.build.option1=-mthumb
glowdeck.build.option2=-nostdlib
glowdeck.build.option3=-D__MK20DX256__
glowdeck.build.option4=-DTEENSYDUINO=118
glowdeck.build.cppoption1=-fno-rtti
glowdeck.build.linkoption1=-mthumb
glowdeck.build.additionalobject1=-larm_cortexM4l_math
glowdeck.build.linkscript=mk20dx256msd.ld
glowdeck.build.architecture=arm-none-eabi
glowdeck.build.command.gcc=arm-none-eabi-gcc
glowdeck.build.command.g++=arm-none-eabi-g++
glowdeck.build.command.ar=arm-none-eabi-ar
glowdeck.build.command.objcopy=arm-none-eabi-objcopy
glowdeck.build.command.objdump=arm-none-eabi-objdump
glowdeck.build.command.size=arm-none-eabi-size
glowdeck.build.core=glowdeck
glowdeck.build.noarchive=true
glowdeck.build.elide_constructors=true
glowdeck.build.gnu0x=true
glowdeck.build.dependency=true
glowdeck.build.time_t=true
#glowdeck.build.linker_relaxation=true
glowdeck.build.post_compile_script=null
#glowdeck.build.serial_number=true
glowdeck.menu.usb.serial.name=Serial
glowdeck.menu.usb.serial.build.define0=-DUSB_SERIAL
glowdeck.menu.speed.96.name=96 MHz (overclock)
glowdeck.menu.speed.48.name=48 MHz
glowdeck.menu.speed.24.name=24 MHz
glowdeck.menu.speed.96.build.f_cpu=96000000
glowdeck.menu.speed.48.build.f_cpu=48000000
glowdeck.menu.speed.24.build.f_cpu=24000000
glowdeck.menu.keys.en-us.name=US English
glowdeck.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH


teensy31.name=Teensy 3.1
teensy31.upload.protocol=halfkay
teensy31.upload.maximum_size=262144
teensy31.upload.maximum_ram_size=65536
teensy31.upload.speed=12000000
teensy31.upload.disable_flushing=true
teensy31.bootloader.path=undefined
teensy31.serial.restart_cmd=true
teensy31.serial.safe_baud_rates_only=true
teensy31.upload.avrdude_wrapper=teensy_reboot
teensy31.build.mcu=mk20dx256
teensy31.build.cpu=cortex-m4
teensy31.build.option1=-mthumb
teensy31.build.option2=-nostdlib
teensy31.build.option3=-D__MK20DX256__
teensy31.build.option4=-DTEENSYDUINO=118
teensy31.build.cppoption1=-fno-rtti
teensy31.build.linkoption1=-mthumb
teensy31.build.additionalobject1=-larm_cortexM4l_math
teensy31.build.linkscript=mk20dx256.ld
teensy31.build.architecture=arm-none-eabi
teensy31.build.command.gcc=arm-none-eabi-gcc
teensy31.build.command.g++=arm-none-eabi-g++
teensy31.build.command.ar=arm-none-eabi-ar
teensy31.build.command.objcopy=arm-none-eabi-objcopy
teensy31.build.command.objdump=arm-none-eabi-objdump
teensy31.build.command.size=arm-none-eabi-size
teensy31.build.core=teensy3
teensy31.build.noarchive=true
teensy31.build.elide_constructors=true
teensy31.build.gnu0x=true
teensy31.build.dependency=true
teensy31.build.time_t=true
#teensy31.build.linker_relaxation=true
teensy31.build.post_compile_script=teensy_post_compile
#teensy31.build.serial_number=true
teensy31.menu.usb.serial.name=Serial
teensy31.menu.usb.serial.build.define0=-DUSB_SERIAL
teensy31.menu.usb.hid.name=Keyboard + Mouse + Joystick
teensy31.menu.usb.hid.build.define0=-DUSB_HID
teensy31.menu.usb.hid.fake_serial=teensy_gateway
teensy31.menu.usb.serialhid.name=Serial + Keyboard + Mouse + Joystick
teensy31.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
#teensy31.menu.usb.int_disk.name=Disk(Internal) + Keyboard
#teensy31.menu.usb.int_disk.build.define0=-DUSB_DISK
#teensy31.menu.usb.int_disk.fake_serial=teensy_gateway
#teensy31.menu.usb.int_disk.build.elfpatch=mktinyfat
#teensy31.menu.usb.sd_disk.name=Disk(SD Card) + Keyboard
#teensy31.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
#teensy31.menu.usb.sd_disk.fake_serial=teensy_gateway
teensy31.menu.usb.midi.name=MIDI
teensy31.menu.usb.midi.build.define0=-DUSB_MIDI
teensy31.menu.usb.midi.fake_serial=teensy_gateway
teensy31.menu.usb.rawhid.name=Raw HID
teensy31.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensy31.menu.usb.rawhid.fake_serial=teensy_gateway
teensy31.menu.usb.flightsim.name=Flight Sim Controls
teensy31.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
teensy31.menu.usb.flightsim.fake_serial=teensy_gateway
teensy31.menu.speed.96.name=96 MHz (overclock)
teensy31.menu.speed.48.name=48 MHz
teensy31.menu.speed.24.name=24 MHz
teensy31.menu.speed.96.build.f_cpu=96000000
teensy31.menu.speed.48.build.f_cpu=48000000
teensy31.menu.speed.24.build.f_cpu=24000000
teensy31.menu.keys.en-us.name=US English
teensy31.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensy31.menu.keys.fr-ca.name=Canadian French
teensy31.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensy31.menu.keys.xx-ca.name=Canadian Multilingual
teensy31.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensy31.menu.keys.da-da.name=Danish
teensy31.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensy31.menu.keys.fi-fi.name=Finnish
teensy31.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensy31.menu.keys.fr-fr.name=French
teensy31.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensy31.menu.keys.fr-be.name=French Belgian
teensy31.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensy31.menu.keys.fr-ch.name=French Swiss
teensy31.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensy31.menu.keys.de-de.name=German
teensy31.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensy31.menu.keys.de-dm.name=German (Mac)
teensy31.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensy31.menu.keys.de-ch.name=German Swiss
teensy31.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensy31.menu.keys.is-is.name=Icelandic
teensy31.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensy31.menu.keys.en-ie.name=Irish
teensy31.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensy31.menu.keys.it-it.name=Italian
teensy31.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensy31.menu.keys.no-no.name=Norwegian
teensy31.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensy31.menu.keys.pt-pt.name=Portuguese
teensy31.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensy31.menu.keys.pt-br.name=Portuguese Brazilian
teensy31.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensy31.menu.keys.es-es.name=Spanish
teensy31.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensy31.menu.keys.es-mx.name=Spanish Latin America
teensy31.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensy31.menu.keys.sv-se.name=Swedish
teensy31.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensy31.menu.keys.tr-tr.name=Turkish (partial)
teensy31.menu.keys.tr-tr.build.define1=-DLAYOUT_TURKISH
teensy31.menu.keys.en-gb.name=United Kingdom
teensy31.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensy31.menu.keys.usint.name=US International
teensy31.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

