PLSCO/Glowduino_PC/Glowduino/hardware/teensy/boards.txt
teensypp1.name=Teensy++ 1.0
teensypp1.upload.protocol=halfkay
teensypp1.upload.maximum_size=64512
teensypp1.upload.maximum_ram_size=4096
teensypp1.upload.speed=12000000
teensypp1.upload.disable_flushing=true
teensypp1.bootloader.path=undefined
teensypp1.serial.restart_cmd=true
teensypp1.serial.safe_baud_rates_only=true
teensypp1.upload.avrdude_wrapper=teensy_reboot
teensypp1.build.mcu=at90usb646
teensypp1.build.option1=-DTEENSYDUINO=118
teensypp1.build.core=teensy
teensypp1.build.elide_constructors=true
teensypp1.build.cpp0x=true
teensypp1.build.dependency=true
teensypp1.build.linker_relaxation=true
teensypp1.build.post_compile_script=teensy_post_compile
teensypp1.build.serial_number=true
teensypp1.menu.usb.serial.name=Serial
teensypp1.menu.usb.serial.build.define0=-DUSB_SERIAL
teensypp1.menu.usb.hid.name=Keyboard + Mouse + Joystick
teensypp1.menu.usb.hid.build.define0=-DUSB_HID
teensypp1.menu.usb.hid.fake_serial=teensy_gateway
teensypp1.menu.usb.serialhid.name=Serial + Keyboard + Mouse + Joystick
teensypp1.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
teensypp1.menu.usb.int_disk.name=Disk(Internal) + Keyboard
teensypp1.menu.usb.int_disk.build.define0=-DUSB_DISK
teensypp1.menu.usb.int_disk.fake_serial=teensy_gateway
teensypp1.menu.usb.int_disk.build.elfpatch=mktinyfat
teensypp1.menu.usb.sd_disk.name=Disk(SD Card) + Keyboard
teensypp1.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
teensypp1.menu.usb.sd_disk.fake_serial=teensy_gateway
teensypp1.menu.usb.midi.name=MIDI
teensypp1.menu.usb.midi.build.define0=-DUSB_MIDI
teensypp1.menu.usb.midi.fake_serial=teensy_gateway
teensypp1.menu.usb.rawhid.name=Raw HID
teensypp1.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensypp1.menu.usb.rawhid.fake_serial=teensy_gateway
teensypp1.menu.speed.16.name=16 MHz
teensypp1.menu.speed.8.name=8 MHz
teensypp1.menu.speed.4.name=4 MHz
teensypp1.menu.speed.2.name=2 MHz
teensypp1.menu.speed.1.name=1 MHz
teensypp1.menu.speed.16.build.f_cpu=16000000L
teensypp1.menu.speed.8.build.f_cpu=8000000L
teensypp1.menu.speed.4.build.f_cpu=4000000L
teensypp1.menu.speed.2.build.f_cpu=2000000L
teensypp1.menu.speed.1.build.f_cpu=1000000L
teensypp1.menu.keys.en-us.name=US English
teensypp1.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensypp1.menu.keys.fr-ca.name=Canadian French
teensypp1.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensypp1.menu.keys.xx-ca.name=Canadian Multilingual
teensypp1.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensypp1.menu.keys.da-da.name=Danish
teensypp1.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensypp1.menu.keys.fi-fi.name=Finnish
teensypp1.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensypp1.menu.keys.fr-fr.name=French
teensypp1.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensypp1.menu.keys.fr-be.name=French Belgian
teensypp1.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensypp1.menu.keys.fr-ch.name=French Swiss
teensypp1.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensypp1.menu.keys.de-de.name=German
teensypp1.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensypp1.menu.keys.de-dm.name=German (Mac)
teensypp1.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensypp1.menu.keys.de-ch.name=German Swiss
teensypp1.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensypp1.menu.keys.is-is.name=Icelandic
teensypp1.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensypp1.menu.keys.en-ie.name=Irish
teensypp1.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensypp1.menu.keys.it-it.name=Italian
teensypp1.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensypp1.menu.keys.no-no.name=Norwegian
teensypp1.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensypp1.menu.keys.pt-pt.name=Portuguese
teensypp1.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensypp1.menu.keys.pt-br.name=Portuguese Brazilian
teensypp1.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensypp1.menu.keys.es-es.name=Spanish
teensypp1.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensypp1.menu.keys.es-mx.name=Spanish Latin America
teensypp1.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensypp1.menu.keys.sv-se.name=Swedish
teensypp1.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensypp1.menu.keys.en-gb.name=United Kingdom
teensypp1.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensypp1.menu.keys.usint.name=US International
teensypp1.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

